# CreateHasValueParameterRule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterFilterRuleFactory..::..CreateHasValueParameterRule Method
ParameterFilterRuleFactory Class See Also
---
Creates a filter rule that determines whether an element's parameter has a value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public static FilterRule CreateHasValueParameterRule(
	ElementId parameter
)
```

Visual Basic
---
```text
Public Shared Function CreateHasValueParameterRule ( _
	parameter As ElementId _
) As FilterRule
```

Visual C++
---
```text
public:
static FilterRule^ CreateHasValueParameterRule(
	ElementId^ parameter
)
```

# ### Parameters
parameter
    Type: Autodesk.Revit.DB..::..ElementId The parameter to be evaluated by the filter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace